---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveInViewError
source: html/2e37b68e-4a2f-7fd5-880b-82d7071e835a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveInViewError Property

Can't move element because the move plane is seen at a very sharp angle in this View

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveInViewError { get; }
```